function slide=var120
% This is a slideshow file for use with playshow.m and makeshow.m
% To see it run, type 'playshow var120', 

% Copyright (c) 1984-98 by The MathWorks, Inc.
if nargout<1,
  playshow var120
else
  %========== Slide 1 ==========

  slide(1).code={
   'DATA = imread(''var20.bmp'');',
   'imshow(DATA);',
   'imwrite(DATA, ''myfile.bmp'');',
   '',
   '' };
  slide(1).text={
   'Да се състави линеен модел на невронна мрежа с 7 входа Х с по 4 елемента, като съответно за Х1 {x11, x12,…… ,x1n) до Хk(Хk1..Хkn)те са:',
   ' Х1[3 5 -6 1], Х2[2 2 7 2], Х3[-3 3 5 4], Х4[-2 7 1 3], Х5[-7 3 -4 -13], Х6[1 -1 -3 3] ,Х7[1 9 -5 10]; тегловни коефициенти W={W1…Wk}, съответно W= [3 1 1 3 3 2 1] и отместване b=5. Целевата функция е съответно T= W *Х+b. Да се провери дали мрежата ще може да бъде обучена за 150 епохи при желана максимална големина на квадратичната грешка 0,0001'};

  %========== Slide 2 ==========

  slide(2).code={
   '' };
  slide(2).text={
   ', като в случай че това условие не бъде изпълнено установете при какъв максимален брой итерации грешката ще се минимизира. След изпълнението на тези задачи обучете невронната мрежа, като прибавите към входните елементи бял гаусов шум с големина на зашумеността до 6%. Проверете какви са разликите на изхода между случая със зашумени и незашумени входни елементи.',
   '',
   '',
   ''};
end