function slide=var10
% This is a slideshow file for use with playshow.m and makeshow.m
% To see it run, type 'playshow var10', 

% Copyright (c) 1984-98 by The MathWorks, Inc.
if nargout<1,
  playshow var10
else
  %========== Slide 1 ==========

  slide(1).code={
   'DATA = imread(''var10.bmp'');',
   'imshow(DATA);',
   'imwrite(DATA, ''myfile.bmp'');',
   '',
   '' };
  slide(1).text={
   'Да се състави линеен модел на невронна мрежа с 7 входа Х с по 4 елемента, като съответно за Х1 {x11, x12,…… ,x1n) до Хk(Хk1..Хkn)те са:',
   ' Х1[23 15 -16 10], Х2[21 22 17 12], Х3[-32 33 35 14], Х4[-23 17 14  13], Х5[-17 23 -14 -13], Х6[21 -11 -23 13] ,Х7[13 19 -5 10]; тегловни коефициенти W={W1…Wk}, съответно W= [4 2 1 3 1 2 1] и отместване b=3. Целевата функция е съответно T= W *Х+b. Да се провери дали мрежата ще може да бъде обучена за 50 епохи при желана максимална големина на квадратичната грешка 0,0001'};

  %========== Slide 2 ==========

  slide(2).code={
   '' };
  slide(2).text={
   'като в случай че това условие не бъде изпълнено установете при какъв максимален брой итерации грешката ще се минимизира. След изпълнението на тези задачи обучете невронната мрежа, като прибавите към входните елементи бял гаусов шум с големина на зашумеността до 5%. Проверете какви са разликите на изхода между случая със зашумени и незашумени входни елементи.'};
end