function slide=var32
% This is a slideshow file for use with playshow.m and makeshow.m
% To see it run, type 'playshow var32', 

% Copyright (c) 1984-98 by The MathWorks, Inc.
if nargout<1,
  playshow var32
else
  %========== Slide 1 ==========

  slide(1).code={
   'DATA = imread(''var2.bmp'');',
   'imshow(DATA);',
   'imwrite(DATA, ''myfile.bmp'');',
   '',
   '' };
  slide(1).text={
   'Обучете невронна мрежа с обратно разпространение на грешката с 5 входа с по 20 елемента (нека те са произволно генерирани числа) до достигане на зададената желана зададена максимална точност 0,02 и скорост на сходимост 0,05. Нека елементите на целевия вектор Т представляват нелинейни функции на входа от типа Хi4/(wi*Хi+b). Нека скрития слой има два неврона, отклонението b=3 и тегловните коефициенти са съответно W=[2 5 3 4 1]'};

  %========== Slide 2 ==========

  slide(2).code={
   '' };
  slide(2).text={
   'Изследвайте по какъв начин влияе промяната на броя неврони във втория слой и изчертайте графиката на средноквадратичната грешка. След като мрежата бъде обучена зашумете входната извадка с 5% отклонение. Обучете мрежата използвайки зашумената входна извадка. Сравнете поведението на мрежата за случаите, когато тя е обучена без и с наличие на шум, когато на входа се подава зашумената извадка.'};
end