function slide=var315
% This is a slideshow file for use with playshow.m and makeshow.m
% To see it run, type 'playshow var315', 

% Copyright (c) 1984-98 by The MathWorks, Inc.
if nargout<1,
  playshow var315
else
  %========== Slide 1 ==========

  slide(1).code={
   'DATA = imread(''var15.bmp'');',
   'imshow(DATA);',
   'imwrite(DATA, ''myfile.bmp'');',
   '',
   '' };
  slide(1).text={
   'Обучете невронна мрежа с обратно разпространение на грешката с 4 входа с по 26 елемента (нека те са произволно генерирани числа) до достигане на зададената желана зададена максимална точност 0,005 и скорост на сходимост 0,002. Нека елементите на целевия вектор Т представляват нелинейни функции на входа от типа Хi3/4/(wi*Хi+b). Нека скрития слой има един неврон, отклонението b=2 и тегловните коефициенти са съответно W=[1 2 1 1].'};

  %========== Slide 2 ==========

  slide(2).code={
   '' };
  slide(2).text={
   'Изследвайте по какъв начин влияе промяната на броя неврони във втория слой и изчертайте графиката на средноквадратичната грешка.След като мрежата бъде обучена зашумете входната извадка с 10% отклонение. Обучете мрежата използвайки зашумената входна извадка. Сравнете поведението на мрежата за случаите, когато тя е обучена без и с наличие на шум, когато на входа се подава зашумената извадка.'};
end