function slide=upr24
% This is a slideshow file for use with playshow.m and makeshow.m
% To see it run, type 'playshow upr24', 

% Copyright (c) 1984-98 by The MathWorks, Inc.
if nargout<1,
  playshow upr24
else
  %========== Slide 1 ==========

  slide(1).code={
   'DATA = imread(''var4.bmp'');',
   'imshow(DATA);',
   'imwrite(DATA, ''myfile.bmp'');',
   '' };
  slide(1).text={
   'Нека са зададени следните двумерни входни елементи в матричен вид а Р със съответната им класова принадлежност зададена от вектора Т',
   '     |+0.6  -0.5  +0.6  -0.8  +0.5|',
   'Р= |-0.5  +0.5  -0.7  +0.9    -1  |   и функция на класова принадлежност Т=|0 0 1 0 1| (Т=|1 0 0 0 1|)',
   'Да се установи възможно ли е да бъдат линейно разделени входните елементи на два класа чрез използването на единичен перцептрон за областта х (-1,1) , y (-1,1) с използването на'};

  %========== Slide 2 ==========

  slide(2).code={
   '' };
  slide(2).text={
   'вектора Т указващ класовата принадлежност, след което ако се получи успешно разделяне на елементите операцията да се повтори като се използва вектора Т зададен в скобите. Да се провери и при двата случая каква е стойността на грешката при края на алгоритъма.',
   'След изпълнението на поставените задачи за входното множество зададено с тримерен вектор Р, да се открие линейно разделими ли са входните елементи, чрез използване на двa'};

  %========== Slide 3 ==========

  slide(3).code={
   '' };
  slide(3).text={
   'перцептрона ако стойностите за Р и векторите Т1 и Т2 указващи принадлежността са съответно за:',
   '          |+0.1  +0.7  +0.8  +0.8  +1.0  +0.3  +0.0  -0.3  -0.5  -1.5 +1.2  +1.8  +1.6|',
   'P =    |+1.2  +1.8  +1.6  +0.6  +0.8  +0.5  +0.2  +0.8  -1.5  -1.3  +0.3  +0.0  -0.3|',
   '          |+0.1  +0.7  +0.8  +0.8  +1.0  +0.3  +0.0  -0.3  -0.5  -1.5 +0.1  +0.7  +0.8|',
   'T1 = [1 1 1 0 0 1 0 1 1 0 1 0 1;  1 0 1 0 0 1 0 0 1 1 1 1 1] и',
   'T2 = [0 1 0 1 0 1 0 0 1 1 1 1 1;  1 0 0 0 0 0 1 0 1 1 0 1 1]',
   '',
   ''};
end